# ManyCCWLoopsError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ManyCCWLoopsError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area defined by sketch must be connected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ManyCCWLoopsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ManyCCWLoopsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ManyCCWLoopsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace